//
//  Localizable.strings
//  Engish (en)
//
//  LabsSearch
//
//  Copyright © 2018 Distant Labs. All rights reserved.
//


// MARK: - Search Engine

"SearchEngine.defaultEngines-Google" = "Google";
"SearchEngine.defaultEngines-AppleMaps" = "Apple Maps";
"SearchEngine.defaultEngines-NamuWiki" = "Namuwiki";
"SearchEngine.defaultEngines-Naver" = "Naver";
"SearchEngine.defaultEngines-NaverKoEnDictionary" = "Naver Korean-English Dictionary";
"SearchEngine.defaultEngines-QDWiki" = "QD Wiki";
"SearchEngine.defaultEngines-Wikipedia" = "Wikipedia";
"SearchEngine.defaultEngines-WikipediaURL" = "https://en.m.wikipedia.org/w/";
"SearchEngine.defaultEngines-YouTube" = "YouTube";


// MARK: - Settings

// MARK: Stay In App explanation
"Settings.stayInAppFooter-On" = "Search results will show inside this app when possible.";
"Settings.stayInAppFooter-Off" = "Search results will open in Safari or another app.";

"Settings.defaultEngineNameLabel-Choose" = "Choose";

// MARK: Reset app alert
"Settings.resetAppAlert-Title" = "Reset All Services";
"Settings.resetAppAlert-Message" = "This will remove all custom services and shortcuts, and set up the default services and shortcuts.";
"Settings.resetAppAlert-Reset" = "Reset";
"Settings.resetAppAlert-Cancel" = "Cancel";


// MARK: - OpenSearch

"OpenSearch.firstSection-Instructions" = "Enter the link for the service you would like to add.";


// MARK: - Add/Edit Engine

"AddEditEngine.navigationItemTitle-Add" = "Add Service";
"AddEditEngine.navigationItemTitle-Edit" = "Edit Service";

// MARK: URL details update status
"AddEditEngine.urlDetails-Saved" = "Saved";
"AddEditEngine.urlDetails-Changed" = "Changed";
//"AddEditEngine.urlDetails-NotUpdated" = "Not %@";
"AddEditEngine.urlDetails-NotUpdated" = "Not Modified";

// MARK: Delete engine alert
"AddEditEngine.deleteEngine-Remove" = "Remove";
"AddEditEngine.deleteEngine-Cancel" = "Cancel";


// MARK: - URL Details

//"UrlDetails.firstSection-Instructions" = "In Safari, search using the service you wish to add. Once you see the results, copy the link and paste it here. If you just search for %@, the next step should be automatic.";
"UrlDetails.firstSection-Instructions" = "In Safari, search for %@ using the service you wish to add. Once you see the results, copy the link to here.";
